html/optimizing-software-in-cpp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Optimizing software in C++(An optimization guide for Windows, Linux and Mac platforms)</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="dirtysalt" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content">
<h1 class="title">Optimizing software in C++(An optimization guide for Windows, Linux and Mac platforms)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb8d4453">1. Introduction</a></li>
<li><a href="#orga52f8bd">2. Choosing the optimal platform</a>
<ul>
<li><a href="#org80030ff">2.1. Choice of operating system</a></li>
</ul>
</li>
<li><a href="#org803a9c7">3. Finding the biggest time consumers</a>
<ul>
<li><a href="#orgfe89662">3.1. Use a profiler to find hot spots</a></li>
</ul>
</li>
<li><a href="#orgacb60ed">4. Performance and usability</a></li>
<li><a href="#orgdea08d2">5. Choosing the optimal algorithm</a></li>
<li><a href="#org53da76d">6. Development process</a></li>
<li><a href="#org37072ee">7. The efficiency of different C++ constructs</a>
<ul>
<li><a href="#orgd7e2ad0">7.1. Different kinds of variable storage</a></li>
<li><a href="#orgd95b7da">7.2. Integers variables and operators</a></li>
<li><a href="#org872063c">7.3. Floating point variables and operators</a></li>
<li><a href="#orgeb515d3">7.4. Function pointers</a></li>
<li><a href="#org968ad99">7.5. Type conversions</a></li>
<li><a href="#org8cf6f5a">7.6. Branches and switch statements</a></li>
<li><a href="#org019857f">7.7. Functions</a></li>
</ul>
</li>
<li><a href="#orge07afcd">8. Optimizations in the compiler</a>
<ul>
<li><a href="#orgbb004f4">8.1. How compilers optimize</a></li>
<li><a href="#orgc984bb4">8.2. Comparison of different compilers</a></li>
<li><a href="#org980d865">8.3. Obstacles to optimization by compiler</a></li>
<li><a href="#org5efa65b">8.4. Obstacles to optimization by CPU</a></li>
<li><a href="#org9c6350a">8.5. Compiler optimization options</a></li>
<li><a href="#org53a8454">8.6. Optimization directives</a></li>
<li><a href="#orgce86b37">8.7. Checking what the compiler does</a></li>
</ul>
</li>
<li><a href="#org58141ef">9. Optimizing memory access</a>
<ul>
<li><a href="#orgbd87ae1">9.1. Caching of code and data</a></li>
<li><a href="#org5ebe537">9.2. Cache organization</a></li>
<li><a href="#org7c41ef8">9.3. Functions that are used together should be stored together</a></li>
<li><a href="#orga8adafd">9.4. Variables that are used together should be stored together</a></li>
<li><a href="#org476c310">9.5. Alignment of data</a></li>
<li><a href="#org662279a">9.6. Dynamic memory allocation</a></li>
<li><a href="#org914288e">9.7. Container classes</a></li>
<li><a href="#orgc3c1aeb">9.8. Strings</a></li>
<li><a href="#org4822ef3">9.9. Access data sequentially</a></li>
<li><a href="#org9c3793c">9.10. Cache contentions in large data structures</a></li>
<li><a href="#org1841b20">9.11. Explicit cache control</a></li>
</ul>
</li>
<li><a href="#org0be4e69">10. Multithreading</a>
<ul>
<li><a href="#orgad73364">10.1. Hyperthreading</a></li>
</ul>
</li>
<li><a href="#orgcb57846">11. Out of order execution</a></li>
<li><a href="#org9704688">12. Using vector operations</a></li>
<li><a href="#org1440767">13. Making critical code in multiple versions for different instruction sets</a></li>
<li><a href="#org92706d7">14. Specific optimization topics</a>
<ul>
<li><a href="#org1f7da2c">14.1. Use lookup tables</a></li>
<li><a href="#org8db0193">14.2. Bounds checking</a></li>
<li><a href="#orge3c97a7">14.3. Use bitwise operators for checking multiple values at once</a></li>
<li><a href="#orgbaebf49">14.4. Integer multiplication</a></li>
<li><a href="#org0100ee5">14.5. Integer division</a></li>
<li><a href="#orgd294a72">14.6. Floating point division</a></li>
<li><a href="#org223bea1">14.7. Don't mix float and double</a></li>
<li><a href="#orgcb0f02a">14.8. Conversions between floating point numbers and integers</a></li>
<li><a href="#org5adcaf0">14.9. Using integer operations for manipulating floating point variables</a></li>
<li><a href="#orga3d6a72">14.10. Mathematical functions</a></li>
<li><a href="#org84e17a6">14.11. Static versus dynamic libraries</a></li>
<li><a href="#orgce5cd7b">14.12. Position-independent code</a></li>
<li><a href="#org3716a14">14.13. System programming</a></li>
</ul>
</li>
<li><a href="#org8574109">15. Metaprogramming</a></li>
<li><a href="#org3bd456c">16. Testing speed</a>
<ul>
<li><a href="#org75a0852">16.1. The pitfalls of unit-testing</a></li>
<li><a href="#orgf730afc">16.2. Worst-case testing</a></li>
</ul>
</li>
<li><a href="#orgacacaa7">17. Optimization in embedded systems</a></li>
<li><a href="#org14a3b88">18. Overview of compiler options</a></li>
</ul>
</div>
</div>
<p>
<a href="http://www.agner.org/optimize/">http://www.agner.org/optimize/</a>
</p>

<div id="outline-container-orgb8d4453" class="outline-2">
<h2 id="orgb8d4453"><span class="section-number-2">1</span> Introduction</h2>
</div>
<div id="outline-container-orga52f8bd" class="outline-2">
<h2 id="orga52f8bd"><span class="section-number-2">2</span> Choosing the optimal platform</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org80030ff" class="outline-3">
<h3 id="org80030ff"><span class="section-number-3">2.1</span> Choice of operating system</h3>
<div class="outline-text-3" id="text-2-1">
<p>
64 bit systems have several advantages over 32 bit systems:
</p>
<ul class="org-ul">
<li>The number of registers is doubled. This makes it possible to store intermediate data and local variables in registers rather than in memory.</li>
<li>Function parameters are transferred in registers rather than on the stack. This makes function calls more efficient.</li>
<li>The size of the integer registers is extended to 64 bits. This is only an advantage in applications that can take advantage of 64-bit integers.</li>
<li>The allocation and deallocation of big memory blocks is more efficient.</li>
<li>The SSE2 instruction set is supported on all 64-bit CPUs and operating systems.</li>
<li>The 64 bit instruction set supports self-relative addressing of data. This makes position-independent code more efficient.</li>
</ul>
<p>
64 bit systems have the following disadvantages compared to 32 bit systems:
</p>
<ul class="org-ul">
<li>Pointers, references, and stack entries use 64 bits rather than 32 bits. This makes data caching less efficient.</li>
<li>Access to static or global arrays require a few extra instructions for address calculation in 64 bit mode if the image base is not guaranteed to be less than 2^31. This extra cost is seen in 64 bit Windows and Mac programs but rarely in Linux.</li>
<li>Address calculation is more complicated in a large memory model where the combined size of code and data can exceed 2 Gbytes. This large memory model is hardly ever used, though.</li>
<li>Some instructions are one byte longer in 64 bit mode than in 32 bit mode.</li>
<li>Some 64-bit compilers are inferior to their 32-bit counterparts.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org803a9c7" class="outline-2">
<h2 id="org803a9c7"><span class="section-number-2">3</span> Finding the biggest time consumers</h2>
<div class="outline-text-2" id="text-3">
</div>
