html/optimizing-software-in-cpp.html
<div id="outline-container-orgfe89662" class="outline-3">
<h3 id="orgfe89662"><span class="section-number-3">3.1</span> Use a profiler to find hot spots</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Most compiler packages include a profiler that can tell how many times each function is
called and how much time it uses. There are also third-party profilers such as AQtime, Intel
VTune and AMD CodeAnalyst.
</p>

<p>
There are several different profiling methods:
</p>
<ul class="org-ul">
<li>Instrumentation: The compiler inserts extra code at each function call to count how many times the function is called and how much time it takes.</li>
<li>Debugging. The profiler inserts temporary debug breakpoints at every function or every code line.</li>
<li>Time-based sampling: The profiler tells the operating system to generate an interrupt, e.g. every millisecond. The profiler counts how many times an interrupt occurs in each part of the program. This requires no modification of the program under test, but is less reliable.</li>
<li>Event-based sampling: The profiler tells the CPU to generate interrupts at certain events, for example every time a thousand cache misses have occurred. This makes it possible to see which part of the program has most cache misses, branch mispredictions, floating point exceptions, etc. Event-based sampling requires a CPU-specific profiler. For Intel CPUs use Intel VTune, for AMD CPUs use AMD CodeAnalyst.（CPU可以提供很多性能计数器）</li>
</ul>

<p>
Unfortunately, profilers are often unreliable. They sometimes give misleading results or fail
completely because of technical problems. Some common problems with profilers are:
</p>
<ul class="org-ul">
<li>Coarse time measurement. If time is measured with millisecond resolution and the critical functions take microseconds to execute then measurements can become imprecise or simply zero.</li>
<li>Execution time too small or too long. If the program under test finishes in a short time then the sampling generates too little data for analysis. If the program takes too long time to execute then the profiler may sample more data than it can handle.</li>
<li>Waiting for user input. Many programs spend most of their time waiting for user input or network resources. This time is included in the profile. It may be necessary to modify the program to use a set of test data instead of user input in order to make profiling feasible.</li>
<li>Interference from other processes. The profiler measures not only the time spent in the program under test but also the time used by all other processes running on the same computer, including the profiler itself.</li>
<li>Function addresses are obscured in optimized programs. The profiler identifies any hot spots in the program by their address and attempts to translate these addresses to function names. But a highly optimized program is often reorganized in such a way that there is no clear correspondence between function names and code addresses. The names of inlined functions may not be visible at all to the profiler. The result will be misleading reports of which functions take most time.（使用优化版本的话函数地址可能会被优化掉，这样不利于分析）</li>
<li>Uses debug version of the code. Some profilers require that the code you are testing contains debug information in order to identify individual functions or code lines. The debug version of the code is not optimized.（而使用调试版本虽然利于分析，但是性能却不是最优的）</li>
<li>Jumps between CPU cores. A process or thread does not necessarily stay in the same processor core on multi-core CPUs, but event-counters do. This results in meaningless event counts for threads that jump between multiple CPU cores. You may need to lock a thread to a specific CPU core by setting a thread affinity mask.（如果某个线程在多个CPU上执行的话，那么每个核上CPU计数器没有意义。解决办法是将thread绑定到某个CPU上）</li>
<li>Poor reproducibility. Delays in program execution may be caused by random events that are not reproducible. Such events as task switches and garbage collection can occur at random times and make parts of the program appear to take longer time than normally.</li>
</ul>

<p>
There are various alternatives to using a profiler. A simple alternative is to run the program
in a debugger and press break while the program is running. If there is a hot spot that uses
90% of the CPU time then there is a 90% chance that the break will occur in this hot spot.
Repeating the break a few times may be enough to identify a hot spot. Use the call stack in
the debugger to identify the circumstances around the hot spot.
</p>

<p>
Sometimes, the best way to identify performance bottlenecks is to put measurement
instruments into the code rather than using a ready-made profiler. This does not solve all
the problems associated with profiling, but it often gives more reliable results. If you are not
satisfied with the way a profiler works then you may put the desired measurement
instruments into the program itself. You may add counter variables that count how many
times each part of the program is executed. Furthermore, you may read the time before and
after each of the most important or critical parts of the program to measure how much time
each part takes.（通常来说自己编写profiler也是非常有必要的）
</p>

<p>
The time measurements may require a very high resolution if time intervals are short. In
Windows, you can use the GetTickCount or QueryPerformanceCounter functions for
millisecond resolution. A much higher resolution can be obtained with the time stamp
counter in the CPU, which counts at the CPU clock frequency.（通过CPU时钟计数器来计时）
</p>

<p>
The time stamp counter becomes invalid if a thread jumps between different CPU cores.
You may have to fix the thread to a specific CPU core during time measurements to avoid
this. (In Windows, SetThreadAffinityMask, in Linux, sched_setaffinity).（为了避免线程在多个CPU上执行的话需要绑定CPU）
</p>

<p>
The program should be tested with a realistic set of test data. The test data should contain a
typical degree of randomness in order to get a realistic number of cache misses and branch
mispredictions.（使用真实数据或者是达到真实数据的效果，然后进行分析）
</p>

<p>
If a library function or any other small piece of code is particularly critical then it may be
useful to measure the number of cache misses, branch mispredictions, floating point
exceptions, etc. in this piece of code. （如果是片段代码或者是库函数的话还需要考虑cache miss，分支预测错误，浮点数异常等问题）
</p>
</div>
</div>
</div>

<div id="outline-container-orgacb60ed" class="outline-2">
<h2 id="orgacb60ed"><span class="section-number-2">4</span> Performance and usability</h2>
</div>
<div id="outline-container-orgdea08d2" class="outline-2">
<h2 id="orgdea08d2"><span class="section-number-2">5</span> Choosing the optimal algorithm</h2>
</div>
<div id="outline-container-org53da76d" class="outline-2">
<h2 id="org53da76d"><span class="section-number-2">6</span> Development process</h2>
</div>
<div id="outline-container-org37072ee" class="outline-2">
<h2 id="org37072ee"><span class="section-number-2">7</span> The efficiency of different C++ constructs</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgd7e2ad0" class="outline-3">
<h3 id="orgd7e2ad0"><span class="section-number-3">7.1</span> Different kinds of variable storage</h3>
<div class="outline-text-3" id="text-7-1">
<p>
The volatile keyword specifies that a variable can be changed by another thread. This
prevents the compiler from making optimizations that rely on the assumption that the
variable always has the value it was assigned previously in the code.
The effect of the keyword volatile is that it makes sure the variable is stored in memory
rather than in a register and prevents all optimizations on the variable. This can be useful in
test situations to avoid that some expression is optimized away.
Note that volatile doesn't mean atomic. It doesn't prevent two threads from attempting to
write the variable at the same time. （volatile变量要求编译器必须每次从内存中读取，但是并不意味着线程安全）
</p>

<p>
Most compilers can make thread-local storage of static and global variables by using the
keyword __thread or __declspec(thread). Such variables have one instance for
each thread. Thread-local storage is inefficient because it is accessed through a pointer
stored in a thread environment block. Thread-local storage should be avoided, if possible,
and replaced by storage on the stack (see above, p. 26). Variables stored on the stack
always belong to the thread in which they are created.（线程级别变量访问效率低，每次访问都必须通过指针访问线程块内存）
</p>
</div>
</div>
