src/optimizing-software-in-cpp.org
*** Integers variables and operators
In most cases, there is no difference in speed between using signed and unsigned integers.
But there are a few cases where it matters:
- Division by a constant: Unsigned is faster than signed when you divide an integer with a constant (see page 140). This also applies to the modulo operator %. （除法上无符号数更快）
- Conversion to floating point is faster with signed than with unsigned integers (see page 145).（转换到浮点数，有符号数更快）

Integer operations are generally very fast. Simple integer operations such as addition,
subtraction, comparison, bit operations and shift operations take only one clock cycle on
most microprocessors.（大部分指令只占用一个时钟周期）

Multiplication and division take longer time. Integer multiplication takes 11 clock cycles on
Pentium 4 processors, and 3 - 4 clock cycles on most other microprocessors. Integer
division takes 40 - 80 clock cycles, depending on the microprocessor. Integer division is
faster the smaller the integer size on AMD processors, but not on Intel processors. Details
about instruction latencies are listed in manual 4: "Instruction tables". Tips about how to
speed up multiplications and divisions are given on page 139 and 140, respectively.
（乘法占用3-4个时钟周期，除法占用40-80时钟周期）

*** Floating point variables and operators
Modern microprocessors in the x86 family have two different types of floating point registers
and correspondingly two different types of floating point instructions. Each type has
advantages and disadvantages.

The original method of doing floating point operations involves eight floating point registers
organized as a register stack. These registers have long double precision (80 bits). The
advantages of using the register stack are:（寄存器组织是栈式，内部使用long double精度表示）
- All calculations are done with long double precision.
- Conversions between different precisions take no extra time.
- There are intrinsic instructions for mathematical functions such as logarithms and trigonometric functions.
- The code is compact and takes little space in the code cache.
The register stack also has disadvantages:
- It is difficult for the compiler to make register variables because of the way the register stack is organized.
- Floating point comparisons are slow unless the Pentium-II or later instruction set is enabled.
- Conversions between integers and floating point numbers is inefficient.
- Division, square root and mathematical functions take more time to calculate when long double precision is used.

A newer method of doing floating point operations involves eight or sixteen vector registers
(XMM or YMM) which can be used for multiple purposes. Floating point operations are done
with single or double precision, and intermediate results are always calculated with the
same precision as the operands. The advantages of using the vector registers are:
（另外一种方式则和整形寄存器类似，并且支持向量计算。但是不要混用单精度和双精度浮点数，因为之间的转换会非常耗时）
- It is easy to make floating point register variables.
- Vector operations are available for doing parallel calculations on vectors of two double precision or four single precision variables in the XMM registers (see page 105). If the AVX instruction set is available then each vector can hold four double precision or eight single precision variables in the YMM registers.
Disadvantages are:
- Long double precision is not supported.
- The calculation of expressions where operands have mixed precision require precision conversion instructions which can be quite time-consuming (see page 143).
- Mathematical functions must use a function library, but this is often faster than the intrinsic hardware functions.

The floating point stack registers are available in all systems that have floating point
capabilities (except in device drivers for 64-bit Windows). The XMM vector registers are
available in 64-bit systems and in 32-bit systems when the SSE2 or later instruction set is
enabled (single precision requires only SSE). The YMM registers are available if the AVX
instruction set is supported by the processor and the operating system. See page 123 for
how to test for the availability of these instruction sets.

Most compilers will use the XMM registers for floating point calculations whenever they are
available, i.e. in 64-bit mode or when the SSE2 instruction set is enabled. Few compilers
are able to mix the two types of floating point operations and choose the type that is optimal
for each calculation.（基本上64位系统都使用第二种方式）

In most cases, double precision calculations take no more time than single precision. When
the floating point registers are used, there is simply no difference in speed between single
and double precision. Long double precision takes only slightly more time. Single precision
division, square root and mathematical functions are calculated faster than double precision
when the XMM registers are used, while the speed of addition, subtraction, multiplication,
etc. is still the same regardless of precision on most processors (when vector operations are
not used).

You may use double precision without worrying too much about the costs if it is good for the
application. You may use single precision if you have big arrays and want to get as much
data as possible into the data cache. Single precision is good if you can take advantage of
vector operations, as explained on page 105.（单精度和双精度上在性能上差别不是很大，所以完全可以根据应用需要而定）

Floating point addition takes 3 - 6 clock cycles, depending on the microprocessor.
Multiplication takes 4 - 8 clock cycles. Division takes 14 - 45 clock cycles. Floating point
comparisons are inefficient when the floating point stack registers are used. Conversions of
float or double to integer takes a long time when the floating point stack registers are used.
（加法减法占用3-6个时钟周期，乘法占用4-8个时钟周期，除法占用14-45时钟周期，比较代价也不是很高，但是主要不要在单精度和双精度之间做转换）

Do not mix single and double precision when the XMM registers are used. See page 143.

Avoid conversions between integers and floating point variables, if possible. See page 144.（同时也尽量避免浮点和整形之间转换）

*** Function pointers
Calling a function through a function pointer typically takes a few clock cycles more than
calling the function directly if the target address can be predicted. The target address is
predicted if the value of the function pointer is the same as last time the statement was
executed. If the value of the function pointer has changed then the target address is likely to
be mispredicted, which causes a long delay.（通过函数指针调用通常会多占用几个时钟周期，如果分支预测准确的话）

