src/optimizing-software-in-cpp.org
*** Type conversions
Conversions between float, double and long double take no extra time when the
floating point register stack is used. It takes between 2 and 15 clock cycles (depending on
the processor) when the XMM registers are used.（如果使用XMM操作浮点数的话，那么之间转换占用2-15个时钟周期）

Conversion of a signed integer to a float or double takes 4 - 16 clock cycles, depending
on the processor and the type of registers used. Conversion of an unsigned integer takes
longer time. It is faster to first convert the unsigned integer to a signed integer if there is no
risk of overflow. （推荐使用有符号数转换到浮点书，占用4-16个时钟周期）

Conversion of a floating point number to an integer takes a very long time unless the SSE2
or later instruction set is enabled. Typically, the conversion takes 50 - 100 clock cycles. The
reason is that the C/C++ standard specifies truncation so the floating point rounding mode
has to be changed to truncation and back again.（如果不使用SSE2的话这个转换会占用到50-100个时钟周期）

#note: 但是如果打开的话浮点数转到整数时间应该还好，文章里面没有说到，但是我估计应该是在2-10个时钟周期左右

If there are floating point-to-integer conversions in the critical part of a code then it is
important to do something about it. Possible solutions are:
- Avoid the conversions by using different types of variables.
- Move the conversions out of the innermost loop by storing intermediate results as floating point.
- Use 64-bit mode or enable the SSE2 instruction set (requires a microprocessor that supports this).
- Use rounding instead of truncation and make a round function using assembly language. See page 144 for details about rounding.

*** Branches and switch statements
A branch instruction takes typically 0 - 2 clock cycles in the case that the microprocessor
has made the right prediction. The time it takes to recover from a branch misprediction is
approximately 12 - 25 clock cycles, depending on the processor. This is called the branch
misprediction penalty.（分支预测正确跳转占用0-2个时钟周期，而错误的话占用12-25个时钟周期）

*** Functions
Function calls may slow down a program for the following reasons:
- The function call makes the microprocessor jump to a different code address and back again. This may take up to 4 clock cycles. In most cases the microprocessor is able to overlap the call and return operations with other calculations to save time.
- The code cache works less efficiently if the code is fragmented and scattered around in memory.（代码指令分散不利于cache）
- Function parameters are stored on the stack in 32-bit mode. Storing the parameters on the stack and reading them again takes extra time. The delay is significant if a parameter is part of a critical dependency chain, especially on the Pentium 4 processor.（没有足够寄存器传递函数参数）
- Extra time is needed for setting up a stack frame, saving and restoring registers, and possibly save exception handling information.（建立堆栈和保存寄存器）
- Each function call statement occupies a space in the branch target buffer (BTB). Contentions in the BTB can cause branch mispredictions if the critical part of a program has many calls and branches.

The following methods may be used for reducing the time spent on function calls in the critical part of a program.
- Avoid unnecessary functions
- Use inline functions
- Avoid nested function calls in the innermost loop
- Use macros instead of functions
- Use fastcall functions
- Make functions local
- Use whole program optimization
- Use 64-bit mode

Parameter transfer is more efficient in 64-bit mode than in 32-bit mode, and more efficient in
64-bit Linux than in 64-bit Windows. In 64-bit Linux, the first six integer parameters and the
first eight floating point parameters are transferred in registers, totaling up to fourteen
register parameters. In 64-bit Windows, the first four parameters are transferred in registers,
regardless of whether they are integers or floating point numbers. Therefore, 64-bit Linux is
more efficient than 64-bit Windows if functions have more than four parameters. There is no
difference between 32-bit Linux and 32-bit Windows in this respect.（64位系统允许使用更多寄存器来传递函数参数）

** Optimizations in the compiler
*** How compilers optimize
- Function inlining
- Constant folding and constant propagation
- Pointer elimination
- Common subexpression elimination
- Register variables
  - The maximum number of integer register variables is approximately six in 32-bit systems and fourteen in 64-bit systems.
  - The maximum number of floating point register variables is eight in 32-bit systems and sixteen in 64-bit systems.
  - Some compilers have difficulties making floating point register variables in 32-bit systems unless the SSE2 (or later) instruction set is enabled.
- Live range analysis
- Join identical branches
- Eliminate jumps
- Loop unrolling
- Loop invariant code motion
- Induction variables
- Scheduling
- Algebraic reductions
- Devirtualization

*** Comparison of different compilers
*** Obstacles to optimization by compiler
- Cannot optimize across modules
- Pointer aliasing
  - It is also possible to tell the compiler that a specific pointer does not alias anything by using the keyword __restrict or __restrict__, if supported by the compiler.
  - We can never be sure that the compiler takes the hint about no pointer aliasing. The only way to make sure that the code is optimized is to do it explicitly.
- Dynamic memory allocation
- Pure functions
  - Unfortunately, the compiler cannot know that a function is pure if the function is defined in a different module or a function library.
  - __attribute__((const))
- Virtual functions and function pointers
- Algebraic reduction
- Floating point induction variables
- Inlined functions have a non-inlined copy

*** Obstacles to optimization by CPU
