html/optimizing-software-in-cpp.html

<div id="outline-container-org968ad99" class="outline-3">
<h3 id="org968ad99"><span class="section-number-3">7.5</span> Type conversions</h3>
<div class="outline-text-3" id="text-7-5">
<p>
Conversions between float, double and long double take no extra time when the
floating point register stack is used. It takes between 2 and 15 clock cycles (depending on
the processor) when the XMM registers are used.（如果使用XMM操作浮点数的话，那么之间转换占用2-15个时钟周期）
</p>

<p>
Conversion of a signed integer to a float or double takes 4 - 16 clock cycles, depending
on the processor and the type of registers used. Conversion of an unsigned integer takes
longer time. It is faster to first convert the unsigned integer to a signed integer if there is no
risk of overflow. （推荐使用有符号数转换到浮点书，占用4-16个时钟周期）
</p>

<p>
Conversion of a floating point number to an integer takes a very long time unless the SSE2
or later instruction set is enabled. Typically, the conversion takes 50 - 100 clock cycles. The
reason is that the C/C++ standard specifies truncation so the floating point rounding mode
has to be changed to truncation and back again.（如果不使用SSE2的话这个转换会占用到50-100个时钟周期）
</p>

<p>
#note: 但是如果打开的话浮点数转到整数时间应该还好，文章里面没有说到，但是我估计应该是在2-10个时钟周期左右
</p>

<p>
If there are floating point-to-integer conversions in the critical part of a code then it is
important to do something about it. Possible solutions are:
</p>
<ul class="org-ul">
<li>Avoid the conversions by using different types of variables.</li>
<li>Move the conversions out of the innermost loop by storing intermediate results as floating point.</li>
<li>Use 64-bit mode or enable the SSE2 instruction set (requires a microprocessor that supports this).</li>
<li>Use rounding instead of truncation and make a round function using assembly language. See page 144 for details about rounding.</li>
</ul>
</div>
</div>

<div id="outline-container-org8cf6f5a" class="outline-3">
<h3 id="org8cf6f5a"><span class="section-number-3">7.6</span> Branches and switch statements</h3>
<div class="outline-text-3" id="text-7-6">
<p>
A branch instruction takes typically 0 - 2 clock cycles in the case that the microprocessor
has made the right prediction. The time it takes to recover from a branch misprediction is
approximately 12 - 25 clock cycles, depending on the processor. This is called the branch
misprediction penalty.（分支预测正确跳转占用0-2个时钟周期，而错误的话占用12-25个时钟周期）
</p>
</div>
</div>

<div id="outline-container-org019857f" class="outline-3">
<h3 id="org019857f"><span class="section-number-3">7.7</span> Functions</h3>
<div class="outline-text-3" id="text-7-7">
<p>
Function calls may slow down a program for the following reasons:
</p>
<ul class="org-ul">
<li>The function call makes the microprocessor jump to a different code address and back again. This may take up to 4 clock cycles. In most cases the microprocessor is able to overlap the call and return operations with other calculations to save time.</li>
<li>The code cache works less efficiently if the code is fragmented and scattered around in memory.（代码指令分散不利于cache）</li>
<li>Function parameters are stored on the stack in 32-bit mode. Storing the parameters on the stack and reading them again takes extra time. The delay is significant if a parameter is part of a critical dependency chain, especially on the Pentium 4 processor.（没有足够寄存器传递函数参数）</li>
<li>Extra time is needed for setting up a stack frame, saving and restoring registers, and possibly save exception handling information.（建立堆栈和保存寄存器）</li>
<li>Each function call statement occupies a space in the branch target buffer (BTB). Contentions in the BTB can cause branch mispredictions if the critical part of a program has many calls and branches.</li>
</ul>

<p>
The following methods may be used for reducing the time spent on function calls in the critical part of a program.
</p>
<ul class="org-ul">
<li>Avoid unnecessary functions</li>
<li>Use inline functions</li>
<li>Avoid nested function calls in the innermost loop</li>
<li>Use macros instead of functions</li>
<li>Use fastcall functions</li>
<li>Make functions local</li>
<li>Use whole program optimization</li>
<li>Use 64-bit mode</li>
</ul>

<p>
Parameter transfer is more efficient in 64-bit mode than in 32-bit mode, and more efficient in
64-bit Linux than in 64-bit Windows. In 64-bit Linux, the first six integer parameters and the
first eight floating point parameters are transferred in registers, totaling up to fourteen
register parameters. In 64-bit Windows, the first four parameters are transferred in registers,
regardless of whether they are integers or floating point numbers. Therefore, 64-bit Linux is
more efficient than 64-bit Windows if functions have more than four parameters. There is no
difference between 32-bit Linux and 32-bit Windows in this respect.（64位系统允许使用更多寄存器来传递函数参数）
</p>
</div>
</div>
</div>

<div id="outline-container-orge07afcd" class="outline-2">
<h2 id="orge07afcd"><span class="section-number-2">8</span> Optimizations in the compiler</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orgbb004f4" class="outline-3">
<h3 id="orgbb004f4"><span class="section-number-3">8.1</span> How compilers optimize</h3>
<div class="outline-text-3" id="text-8-1">
<ul class="org-ul">
<li>Function inlining</li>
<li>Constant folding and constant propagation</li>
<li>Pointer elimination</li>
<li>Common subexpression elimination</li>
<li>Register variables
<ul class="org-ul">
<li>The maximum number of integer register variables is approximately six in 32-bit systems and fourteen in 64-bit systems.</li>
<li>The maximum number of floating point register variables is eight in 32-bit systems and sixteen in 64-bit systems.</li>
<li>Some compilers have difficulties making floating point register variables in 32-bit systems unless the SSE2 (or later) instruction set is enabled.</li>
</ul></li>
<li>Live range analysis</li>
<li>Join identical branches</li>
<li>Eliminate jumps</li>
<li>Loop unrolling</li>
<li>Loop invariant code motion</li>
<li>Induction variables</li>
<li>Scheduling</li>
<li>Algebraic reductions</li>
<li>Devirtualization</li>
</ul>
</div>
</div>

<div id="outline-container-orgc984bb4" class="outline-3">
<h3 id="orgc984bb4"><span class="section-number-3">8.2</span> Comparison of different compilers</h3>
</div>
<div id="outline-container-org980d865" class="outline-3">
<h3 id="org980d865"><span class="section-number-3">8.3</span> Obstacles to optimization by compiler</h3>
<div class="outline-text-3" id="text-8-3">
<ul class="org-ul">
<li>Cannot optimize across modules</li>
<li>Pointer aliasing
<ul class="org-ul">
<li>It is also possible to tell the compiler that a specific pointer does not alias anything by using the keyword <span class="underline"><span class="underline">restrict or __restrict</span></span>, if supported by the compiler.</li>
<li>We can never be sure that the compiler takes the hint about no pointer aliasing. The only way to make sure that the code is optimized is to do it explicitly.</li>
</ul></li>
<li>Dynamic memory allocation</li>
<li>Pure functions
<ul class="org-ul">
<li>Unfortunately, the compiler cannot know that a function is pure if the function is defined in a different module or a function library.</li>
<li>__attribute__((const))</li>
</ul></li>
<li>Virtual functions and function pointers</li>
<li>Algebraic reduction</li>
<li>Floating point induction variables</li>
<li>Inlined functions have a non-inlined copy</li>
</ul>
</div>
</div>

<div id="outline-container-org5efa65b" class="outline-3">
<h3 id="org5efa65b"><span class="section-number-3">8.4</span> Obstacles to optimization by CPU</h3>
</div>
