html/optimizing-software-in-cpp.html
<div id="outline-container-org9c6350a" class="outline-3">
<h3 id="org9c6350a"><span class="section-number-3">8.5</span> Compiler optimization options</h3>
<div class="outline-text-3" id="text-8-5">
<p>
Some compilers have support for whole program optimization. This works by compiling in
two steps. All source files are first compiled to an intermediate file format instead of the
usual object file format. The intermediate files are then linked together in the second step
where the compilation is finished. Register allocation and function inlining is done at the
second step. The intermediate file format is not standardized. It is not even compatible with
different versions of the same compiler. It is therefore not possible to distribute function
libraries in this format.（程序整体优化使用中间格式而不是使用目标文件格式）
</p>

<p>
The code becomes more efficient when there is no exception handling. It is recommended
to turn off support for exception handling unless the code relies on structured exception
handling and you want the code to be able to recover from exceptions.（关闭异常处理）
</p>

<p>
It is recommended to turn off support for runtime type identification (RTTI)（关闭RTTI）
</p>

<p>
It is recommended to enable fast floating point calculations or turn off requirements for strict
floating point calculations unless the strictness is required.（快速浮点运算关闭严格执行模式）
</p>

<p>
Use the option for "assume no pointer aliasing" if you are sure the code has no pointer
aliasing.（如果确认没有指针别名的话，那么打开“假设没有指针别名”的编译选项）
</p>

<p>
Many compilers have an option for "standard stack frame" or "frame pointer". The standard
stack frame is used for debugging and exception handling. Omitting the standard stack
frame makes function calls faster and makes an extra register available for other purposes.
This is advantageous because registers is a scarce resource. Do not use a stack frame
unless your program relies on exception handling.（对帧指针不分配寄存器。帧指针在调试以及异常处理的时候会使用到）
</p>
</div>
</div>

<div id="outline-container-org53a8454" class="outline-3">
<h3 id="org53a8454"><span class="section-number-3">8.6</span> Optimization directives</h3>
</div>
<div id="outline-container-orgce86b37" class="outline-3">
<h3 id="orgce86b37"><span class="section-number-3">8.7</span> Checking what the compiler does</h3>
</div>
</div>

<div id="outline-container-org58141ef" class="outline-2">
<h2 id="org58141ef"><span class="section-number-2">9</span> Optimizing memory access</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-orgbd87ae1" class="outline-3">
<h3 id="orgbd87ae1"><span class="section-number-3">9.1</span> Caching of code and data</h3>
</div>
<div id="outline-container-org5ebe537" class="outline-3">
<h3 id="org5ebe537"><span class="section-number-3">9.2</span> Cache organization</h3>
</div>
<div id="outline-container-org7c41ef8" class="outline-3">
<h3 id="org7c41ef8"><span class="section-number-3">9.3</span> Functions that are used together should be stored together</h3>
</div>
<div id="outline-container-orga8adafd" class="outline-3">
<h3 id="orga8adafd"><span class="section-number-3">9.4</span> Variables that are used together should be stored together</h3>
</div>
<div id="outline-container-org476c310" class="outline-3">
<h3 id="org476c310"><span class="section-number-3">9.5</span> Alignment of data</h3>
</div>
<div id="outline-container-org662279a" class="outline-3">
<h3 id="org662279a"><span class="section-number-3">9.6</span> Dynamic memory allocation</h3>
<div class="outline-text-3" id="text-9-6">
<p>
A little-known alternative to using new and delete is to allocate variable-size arrays with
alloca. This is a function that allocates memory on the stack rather than the heap. The
space is automatically deallocated when returning from the function in which alloca was
called. There is no need to deallocate the space explicitly when alloca is used.
（使用alloca可以在栈上开辟空间，但是需要防止栈溢出）
</p>
</div>
</div>

<div id="outline-container-org914288e" class="outline-3">
<h3 id="org914288e"><span class="section-number-3">9.7</span> Container classes</h3>
</div>
<div id="outline-container-orgc3c1aeb" class="outline-3">
<h3 id="orgc3c1aeb"><span class="section-number-3">9.8</span> Strings</h3>
</div>
<div id="outline-container-org4822ef3" class="outline-3">
<h3 id="org4822ef3"><span class="section-number-3">9.9</span> Access data sequentially</h3>
</div>
<div id="outline-container-org9c3793c" class="outline-3">
<h3 id="org9c3793c"><span class="section-number-3">9.10</span> Cache contentions in large data structures</h3>
</div>
<div id="outline-container-org1841b20" class="outline-3">
<h3 id="org1841b20"><span class="section-number-3">9.11</span> Explicit cache control</h3>
<div class="outline-text-3" id="text-9-11">
<p>
包括预取指令（如果不是使用常规访问模式来访问内存的话）以及”写内存但是不写缓存“指令（如果确定数据之后不会读取上来并且cache冲突严重）
</p>
</div>
</div>
</div>

<div id="outline-container-org0be4e69" class="outline-2">
<h2 id="org0be4e69"><span class="section-number-2">10</span> Multithreading</h2>
<div class="outline-text-2" id="text-10">
<p>
It is important to distinguish between coarse-grained parallelism and fine-grained parallelism
when deciding whether it is advantageous to do things in parallel. Coarse-grained
parallelism refers to the situation where a long sequence of operations can be carried out
independently of other tasks that are running in parallel. Fine-grained parallelism is the
situation where a task is divided into many small subtasks, but it is impossible to work for
very long on a particular subtask before coordination with other subtasks is necessary.（粗粒度和细粒度并行）
</p>

<p>
Multithreading works more efficiently with coarse-grained parallelism than with fine-grained
parallelism because communication and synchronization between the different cores is
slow. If the granularity is too fine then it is not advantageous to split the tasks into multiple
threads. Out-of-order execution (chapter 11) and vector operations (chapter 12) are more
useful methods for exploiting fine-grained parallelism. （多线程适合解决粗粒度并行工作，OOO以及向量操作适合解决细粒度并行工作）
</p>

<p>
In the case of data decomposition, we should preferably
have no more threads with the same priority than the number of cores or logical processors
available in the system. The number of logical processors available can be determined by a
system call (e.g. GetProcessAffinityMask in Windows).（理想情况线程数目和逻辑/物理CPU core数目相同并且有相同优先级别）
</p>

<p>
The multiple CPU cores or logical processors usually share the same cache, at least at the
last cache level, and in some cases even the same level-1 cache. The advantage of sharing
the same cache is that communication between threads becomes faster and that threads
can share the same code and read-only data. The disadvantage is that the cache will be
filled up if the threads use different memory areas, and there will be cache contentions if the
threads write to the same memory areas.（共享cache可以方便数据交换，但是也会造成cache冲突）
</p>

<p>
It is not good to have two or more threads
writing to the same cache line, because the threads will invalidate each other's caches and
cause large delays. The easiest way to make thread-specific data is to declare it locally in
the thread function so that it is stored on the stack. Each thread has its own stack.
Alternatively, you may define a structure or class for containing thread-specific data and
make one instance for each thread. This structure or class should be aligned by at least the
cache line size in order to avoid multiple threads writing to the same cache line. The cache
line size is typically 64 bytes on contemporary processors. The cache line size may possibly
be more (128 or 256 bytes) on future processors. （现代处理器的cache line典型值是64字节，未来可能扩展到128和256字节）
</p>
</div>
