html/optimizing-software-in-cpp.html

<div id="outline-container-org92706d7" class="outline-2">
<h2 id="org92706d7"><span class="section-number-2">14</span> Specific optimization topics</h2>
<div class="outline-text-2" id="text-14">
</div>
<div id="outline-container-org1f7da2c" class="outline-3">
<h3 id="org1f7da2c"><span class="section-number-3">14.1</span> Use lookup tables</h3>
<div class="outline-text-3" id="text-14-1">
<p>
Replacing a function with a lookup table is advantageous in most cases where the number
of possible inputs is limited and there are no cache problems. It is not advantageous to use
a lookup table if you expect the table to be evicted from the cache between each call, and
the time it takes to calculate the function is less than the time it takes to reload the value
from memory plus the costs to other parts of the program of occupying a cache line.（重新计算和表格cache miss相比）
</p>

<p>
Table lookup cannot be vectorized with the current instruction set. Do not use lookup tables
if this prevents a faster vectorized code.（向量化代码）
</p>

<p>
Storing something in static memory can cause caching problems because static data are
likely to be scattered around at different memory addresses. If caching is a problem then it
may be useful to copy the table from static memory to stack memory outside the innermost
loop.（静态内存分布在不同的内存区域上，容易造成cache miss. 存放在栈上可以缓解这个问题）
</p>
</div>
</div>

<div id="outline-container-org8db0193" class="outline-3">
<h3 id="org8db0193"><span class="section-number-3">14.2</span> Bounds checking</h3>
<div class="outline-text-3" id="text-14-2">
<div class="org-src-container">
<pre class="src src-C++"><span class="org-keyword">if</span> (i &lt; 0 || i &gt;= size) {
  cout &lt;&lt; <span class="org-string">"Error: Index out of range"</span>;
}
<span class="org-comment-delimiter">// </span><span class="org-comment">TO</span>
<span class="org-keyword">if</span> ((<span class="org-type">unsigned</span> <span class="org-type">int</span>)i &gt;= (<span class="org-type">unsigned</span> <span class="org-type">int</span>)size) {
  cout &lt;&lt; <span class="org-string">"Error: Index out of range"</span>;
}

<span class="org-keyword">if</span> (i &gt;= min &amp;&amp; i &lt;= max) { ... }
<span class="org-comment-delimiter">// </span><span class="org-comment">TO</span>
<span class="org-keyword">if</span> ((<span class="org-type">unsigned</span> <span class="org-type">int</span>)(i - min) &lt;= (<span class="org-type">unsigned</span> <span class="org-type">int</span>)(max - min)) { ...

</pre>
</div>
</div>
</div>

<div id="outline-container-orge3c97a7" class="outline-3">
<h3 id="orge3c97a7"><span class="section-number-3">14.3</span> Use bitwise operators for checking multiple values at once</h3>
</div>
<div id="outline-container-orgbaebf49" class="outline-3">
<h3 id="orgbaebf49"><span class="section-number-3">14.4</span> Integer multiplication</h3>
<div class="outline-text-3" id="text-14-4">
<p>
Integer multiplication takes longer time than addition and subtraction (3 - 10 clock cycles,
depending on the processor).（整数乘法通常在3-10个时钟周期）
</p>

<div class="org-src-container">
<pre class="src src-C++"><span class="org-keyword">struct</span> <span class="org-type">S1</span> {
  <span class="org-type">int</span> <span class="org-variable-name">a</span>;
  <span class="org-type">int</span> <span class="org-variable-name">b</span>;
  <span class="org-type">int</span> <span class="org-variable-name">c</span>;
  <span class="org-type">int</span> <span class="org-variable-name">UnusedFiller</span>;
};
<span class="org-keyword">const</span> <span class="org-type">int</span> <span class="org-variable-name">size</span> = 100;
<span class="org-type">S1</span> <span class="org-variable-name">list</span>[size];
</pre>
</div>
<p>
通过增加UnusedFiller字段来使得结构体大小是2^n. 这样从下标偏移对应到内存偏移计算相对就更快速。
</p>

<p>
The advise of using powers of 2 does not apply to very big data structures. On the contrary,
you should by all means avoid powers of 2 if a matrix is so big that caching becomes a
problem. If the number of columns in a matrix is a power of 2 and the matrix is bigger than
the cache then you can get very expensive cache contentions, as explained on page 96.
（但是上面的方法不适合大的数据结构体。因为cache冲突导致cache miss所带来的penalty相比整数乘法而言更大）
</p>
</div>
</div>

<div id="outline-container-org0100ee5" class="outline-3">
<h3 id="org0100ee5"><span class="section-number-3">14.5</span> Integer division</h3>
<div class="outline-text-3" id="text-14-5">
<p>
Integer division takes much longer time than addition, subtraction and multiplication (27 - 80
clock cycles for 32-bit integers, depending on the processor).（整数除法通常在27-80个时钟周期）
</p>

<p>
The following guidelines can be used for improving code that contains integer division:
</p>
<ul class="org-ul">
<li>Integer division by a constant is faster than division by a variable</li>
<li>Integer division by a constant is faster if the constant is a power of 2</li>
<li>Integer division by a constant is faster if the dividend is unsigned</li>
</ul>
</div>
</div>

<div id="outline-container-orgd294a72" class="outline-3">
<h3 id="orgd294a72"><span class="section-number-3">14.6</span> Floating point division</h3>
<div class="outline-text-3" id="text-14-6">
<p>
Floating point division takes much longer time than addition, subtraction and multiplication
(20 - 45 clock cycles). （浮点数除法在20-45个时钟周期，远超过加减乘，所以如果可以的话那么尽量使用乘法代替）
</p>
</div>
</div>

<div id="outline-container-org223bea1" class="outline-3">
<h3 id="org223bea1"><span class="section-number-3">14.7</span> Don't mix float and double</h3>
<div class="outline-text-3" id="text-14-7">
<p>
Floating point calculations usually take the same time regardless of whether you are using
single precision or double precision, but there is a penalty for mixing single and double
precision in programs compiled for 64-bit operating systems and programs compiled for the
instruction set SSE2 or later.（通常来说保持使用单精度或者是多精度所耗费的时间是相同的，但是如果在64位操作系统
或程序下使用SSE2以及后续指令来混合操作两者的话，那么会存在额外开销）
</p>

<p>
There is no penalty for mixing different floating point precisions when the code is compiled
for old processors without the SSE2 instruction set, but it may be preferable to keep the
same precision in all operands in case the code is later ported to another platform.
</p>
</div>
</div>

<div id="outline-container-orgcb0f02a" class="outline-3">
<h3 id="orgcb0f02a"><span class="section-number-3">14.8</span> Conversions between floating point numbers and integers</h3>
<div class="outline-text-3" id="text-14-8">
<p>
<b>Conversion from floating point to integer</b>
</p>

<p>
According to the standards for the C++ language, all conversions from floating point
numbers to integers use truncation towards zero, rather than rounding. This is unfortunate
because truncation takes much longer time than rounding unless the SSE2 instruction set is
used. It is recommended to enable the SSE2 instruction set if possible. SSE2 is always
enabled in 64-bit mode.（C++标准要求浮点转整形是截断而不是舍入，而截断只有在SSE2指令上才能表现良好。
不过在64位下SSE2模式是打开的，所以我们这里主要考虑32位系统）
</p>

<p>
A conversion from floating point to integer without SSE2 typically takes 40 clock cycles. If
you cannot avoid conversions from float or double to int in the critical part of the
code, then you may improve efficiency by using rounding instead of truncation. This is
approximately three times faster. The logic of the program may need modification to
compensate for the difference between rounding and truncation.
（在不使用SSE2情况下，截断使用40个指令周期，而舍入则使用13个指令周期。舍入函数是lrint和lrintf）
</p>

<p>
In 64-bit mode or when the SSE2 instruction set is enabled there is no difference in speed
between rounding and truncation.
</p>

<p>
<b>Conversion from integer to floating point</b>
</p>

<p>
Conversion of integers to floating point is faster than from floating point to integer. The
conversion time is typically between 5 and 20 clock cycles. It may in some cases be
advantageous to do simple integer calculations in floating point variables in order to avoid
conversions from integer to floating point.（占用5-20个时钟周期。所以有时候可以在浮点数上做一些简单的整数操作
来避免整形向浮点数的转换）
</p>

<p>
Conversion of unsigned integers to floating point numbers is less efficient than signed
integers. It is more efficient to convert unsigned integers to signed integers before
conversion to floating point if the conversion to signed integer doesn't cause overflow.
（从有符号数转向浮点数，相比无符号数更快）
</p>
</div>
</div>
