html/optimizing-software-in-cpp.html

<div id="outline-container-org5adcaf0" class="outline-3">
<h3 id="org5adcaf0"><span class="section-number-3">14.9</span> Using integer operations for manipulating floating point variables</h3>
<div class="outline-text-3" id="text-14-9">
<p>
The representation of float, double and long double reflects the floating point value
written as (+-)2^eee * 1.fffff, where ± is the sign, eee is the exponent, and fffff is the
binary decimals of the fraction. The sign is stored as a single bit which is 0 for positive and 1
for negative numbers. The exponent is stored as a biased binary integer, and the fraction is
stored as the binary digits. The exponent is always normalized, if possible, so that the value
before the decimal point is 1. This '1' is not included in the representation, except in the
long double format. The formats can be expressed as follows:
</p>

<div class="org-src-container">
<pre class="src src-C++"><span class="org-keyword">struct</span> <span class="org-type">Sfloat</span> {
  <span class="org-type">unsigned</span> <span class="org-type">int</span> <span class="org-variable-name">fraction</span> : 23; <span class="org-comment-delimiter">// </span><span class="org-comment">fractional part</span>
  <span class="org-type">unsigned</span> <span class="org-type">int</span> <span class="org-variable-name">exponent</span> : 8; <span class="org-comment-delimiter">// </span><span class="org-comment">exponent + 0x7F</span>
  <span class="org-type">unsigned</span> <span class="org-type">int</span> <span class="org-variable-name">sign</span> : 1; <span class="org-comment-delimiter">// </span><span class="org-comment">sign bit</span>
};
<span class="org-keyword">struct</span> <span class="org-type">Sdouble</span> {
  <span class="org-type">unsigned</span> <span class="org-type">int</span> <span class="org-variable-name">fraction</span> : 52; <span class="org-comment-delimiter">// </span><span class="org-comment">fractional part</span>
  <span class="org-type">unsigned</span> <span class="org-type">int</span> <span class="org-variable-name">exponent</span> : 11; <span class="org-comment-delimiter">// </span><span class="org-comment">exponent + 0x3FF</span>
  <span class="org-type">unsigned</span> <span class="org-type">int</span> <span class="org-variable-name">sign</span> : 1; <span class="org-comment-delimiter">// </span><span class="org-comment">sign bit</span>
};
<span class="org-keyword">struct</span> <span class="org-type">Slongdouble</span> {
  <span class="org-type">unsigned</span> <span class="org-type">int</span> <span class="org-variable-name">fraction</span> : 63; <span class="org-comment-delimiter">// </span><span class="org-comment">fractional part</span>
  <span class="org-type">unsigned</span> <span class="org-type">int</span> <span class="org-variable-name">one</span> : 1; <span class="org-comment-delimiter">// </span><span class="org-comment">always 1 if nonzero and normal</span>
  <span class="org-type">unsigned</span> <span class="org-type">int</span> <span class="org-variable-name">exponent</span> : 15; <span class="org-comment-delimiter">// </span><span class="org-comment">exponent + 0x3FFF</span>
  <span class="org-type">unsigned</span> <span class="org-type">int</span> <span class="org-variable-name">sign</span> : 1; <span class="org-comment-delimiter">// </span><span class="org-comment">sign bit</span>
};
</pre>
</div>

<p>
The values of nonzero floating point numbers can be calculated as follows:
</p>
<pre class="example">
floatvalue = (-1)^sign ⋅ 2^(exponent-127) ⋅ (1 + fraction ⋅ 2^-23).
doublevalue = (-1)^sign ⋅ 2^(exponent-1023) ⋅ (1 + fraction ⋅ 2^-52).
longdoublevalue = (-1)^ sign ⋅ 2^(exponent-16383) ⋅ (one + fraction ⋅ 2^-63).
</pre>
<p>
The value is zero if all bits except the sign bit are zero. Zero can be represented with or
without the sign bit.
</p>

<p>
The fact that the floating point format is standardized allows us to manipulate the different
parts of the floating point representation directly with the use of integer operations. This can
be an advantage because integer operations are faster than floating point operations.
</p>

<p>
In general, it is faster to access a floating point variable as an integer if it is stored in
memory, but not if it is a register variable. The union forces the variable to be stored in
memory, at least temporarily. Using the methods in the above examples will therefore be a
disadvantage if other nearby parts of the code could benefit from using registers for the
same variables.（变量只能够存放在内存上而不能够在寄存器中）
</p>

<p>
It is not recommended to modify a double by modifying only half of it, for example if you
want to flip the sign bit in the above example with u.i(1) ^= 0x80000000; because this
is likely to generate a store forwarding delay in the CPU (See manual 3: "The
microarchitecture of Intel, AMD and VIA CPUs"). This can be avoided in 64-bit systems by
using a 64-bit integer rather than two 32-bit integers to alias upon the double.
</p>

<p>
Another problem with accessing 32 bits of a 64-bit double is that it is not portable to systems
with big-endian storage. Example 14.23b and 14.30 will therefore need modification if
implemented on other platforms with big-endian storage. All x86 platforms (Windows, Linux,
BSD, Intel-based Mac OS, etc.) have little-endian storage, but other systems may have big
endian storage (e.g. PowerPC).
</p>

<p>
#note: 比较保险的做法应该是只读取这些变量而不改写，并且需要针对大小端做判断
</p>
</div>
</div>

<div id="outline-container-orga3d6a72" class="outline-3">
<h3 id="orga3d6a72"><span class="section-number-3">14.10</span> Mathematical functions</h3>
<div class="outline-text-3" id="text-14-10">
<p>
The most common mathematical functions such as logarithms, exponential functions,
trigonometric functions, etc. are implemented in hardware in the x86 CPUs. However, a
software implementation is faster than the hardware implementation in most cases when the
SSE2 instruction set is available. The best compilers use the software implementation if the
SSE2 instruction set is enabled.（尽可能使用软件实现的数学函数）
</p>

<p>
The advantage of using a software implementation rather than a hardware implementation
of these functions is higher for single precision than for double precision. But the software
implementation is faster than the hardware implementation in most cases, even for double
precision.（软件实现较硬件实现而言，在单精度浮点上优化更多。但是在大部分情况下即使针对双精度软件实现效果也更好）
</p>
</div>
</div>
