html/optimizing-software-in-cpp.html

<div id="outline-container-org84e17a6" class="outline-3">
<h3 id="org84e17a6"><span class="section-number-3">14.11</span> Static versus dynamic libraries</h3>
<div class="outline-text-3" id="text-14-11">
<p>
The advantages of using static linking rather than dynamic linking are:
</p>
<ul class="org-ul">
<li>Static linking includes only the part of the library that is actually needed by the application, while dynamic linking makes the entire library (or at least a large part of it) load into memory even when just a single function from the library is needed.</li>
<li>All the code is included in a single executable file when static linking is used. Dynamic linking makes it necessary to load several files when the program is started.</li>
<li>It takes longer time to call a function in a dynamic library than in a static link library because it needs an extra jump through a pointer in an import table and possibly also a lookup in a procedure linkage table (PLT).（减少跳转次数）</li>
<li>The memory space becomes more fragmented when the code is distributed between multiple dynamic libraries. The dynamic libraries are loaded at round memory addresses divisible by the memory page size (4096). This will make all dynamic libraries contend for the same cache lines. This makes code caching and data caching less efficient.</li>
<li>Dynamic libraries are less efficient in some systems because of the needs of position-independent code, see below.（pic代码效率）</li>
<li>Installing a second application that uses a newer version of the same dynamic library can change the behavior of the first application if dynamic linking is used, but not if static linking is used.</li>
</ul>

<p>
The advantages of dynamic linking are:
</p>
<ul class="org-ul">
<li>Multiple applications running simultaneously can share the same dynamic libraries without the need to load more than one instance of the library into memory. This is useful on servers that run many processes simultaneously. Actually, only the code section and read-only data sections can be shared. Any writable data section needs one instance for each process.</li>
<li>A dynamic library can be updated to a new version without the need to update the program that calls it.</li>
<li>A dynamic library can be called from programming languages that do not support static linking.</li>
<li>A dynamic library can be useful for making plug-ins that add functionality to an existing program.</li>
</ul>

<p>
The memory address at which a dynamic library is loaded cannot be determined in
advance, because a fixed address might clash with another dynamic library requiring the
same address. There are two commonly used methods for dealing with this problem:
</p>
<ul class="org-ul">
<li>Relocation. All pointers and addresses in the code are modified, if necessary, to fit the actual load address. Relocation is done by the linker and the loader.</li>
<li>Position-independent code. All addresses in the code are relative to the current position.</li>
</ul>

<p>
Windows DLLs use relocation. The DLLs are relocated by the linker to a specific load
address. If this address is not vacant then the DLL is relocated (rebased) once more by the
loader to a different address. A call from the main executable to a function in a DLL goes
through an import table or a pointer. A variable in a DLL can be accessed from main
through an imported pointer, but this feature is seldom used. It is more common to
exchange data or pointers to data through function calls. Internal references to data within
the DLL use absolute references in 32 bit mode and mostly relative references in 64 bit
mode. The latter is slightly more efficient because relative references do not need relocation
at load time.
</p>
</div>
</div>
