src/optimizing-software-in-cpp.org
*** Position-independent code
#note: 之前写过一篇有关于pic的[[file:pic.org][文章]]

A code that is compiled as position-independent has the following features:
- The code section contains no absolute addresses that need relocation, but only self-relative addresses. Therefore, the code section can be loaded at an arbitrary memory address and shared between multiple processes.（代码区域没有使用需要重定位的绝对地址，而使用自身相对地址，所以可以被载入到内存的任意位置）
- The data section is not shared between multiple processes because it often contains writeable data. Therefore, the data section may contain pointers or addresses that need relocation.（数据区域内有指针和地址需要重定位，因为数据区域并不是只读的可能存在多份）
- All public functions and public data can be overridden in Linux and BSD. If a function in the main executable has the same name as a function in a shared object, then the version in main will take precedence, not only when called from main, but also when called from the shared object. Likewise, when a global variable in main has the same name as a global variable in the shared object, then the instance in main will be used, even when accessed from the shared object. This so-called symbol interposition is intended to mimic the behavior of static libraries.
- A shared object has a table of pointers to its functions, called procedure linkage table (PLT) and a table of pointers to its variables called global offset table (GOT) in order to implement this "override" feature. All accesses to functions and public variables go through the PLT and GOT.（PLT来存储函数指针，使用GOT来存储变量指针）

The symbol interposition feature that allows overriding of public functions and data in Linux
and BSD comes at a high price, and in most libraries it is never used. Whenever a function
in a shared object is called, it is necessary to look up the function address in the procedure
linkage table (PLT). And whenever a public variable in a shared object is accessed, it is
necessary to first look up the address of the variable in the global offset table (GOT). These
table lookups are needed even when the function or variable is accessed from within the
same shared object. Obviously, all these table lookup operations slow down the execution
considerably.（不管是查找函数还是变量代价都是非常高的）

Another serious burden is the calculation of self-relative references in 32-bit mode. The 32-
bit x86 instruction set has no instruction for self-relative addressing of data. The code goes
through the following steps to access a public data object: (1) get its own address through a
function call. (2) find the GOT through a self-relative address. (3) look up the address of the
data object in the GOT, and finally (4) access the data object through this address. Step (1)
is not needed in 64-bit mode because the x86-64 instruction set supports self-relative
addressing.（看上去查找数据的开销远高于查找函数的开销）

It is possible to compile a shared object without the -fpic option. Then we get rid of all
the problems mentioned above. Now the code will run faster because we can access
internal variables and internal functions in a single step rather than the complicated address
calculation and table lookup mechanisms explained above. A shared object compiled
without -fpic is much faster, except perhaps for a very large shared object where most of
the functions are never called. The disadvantage of compiling without -fpic in 32-bit Linux
is that the loader will have more references to relocate, but these address calculations are
done only once, while the runtime address calculations have to be done at every access.
The code section needs one instance for each process when compiled without -fpic
because the relocations in the code section will be different for each process. Obviously, we
loose the ability to override public symbols, but this feature is rarely needed anyway.
（对于32位机器可以关闭-fpic选项，那么这样便没有pic代码。所有的重定位都在链接阶段完成，并且需要和使用的process进行联编）

The procedure to calculate self-relative addresses is much simpler in 64-bit mode because
the 64-bit instruction set has support for relative addressing of data. The need for special
position-independent code is smaller because relative addresses are often used by default
anyway in 64-bit code. However, we still want to get rid of the GOT and PLT lookups for
local references.（对于64位系统来说为自身相对地址提供了支持，但是依然需要解决查找GOT和PLT的问题）

If we compile the shared object without -fpic in 64 bit mode, we encounter another
problem. The compiler sometimes uses 32-bit absolute addresses. This works in the main
executable because it is sure to be loaded at an address below 2 GB, but not in a shared
object which is typically loaded at a higher address which can't be reached with a 32-bit
(signed) address. The linker will generate an error message in this case. The best solution
is to compile with the option -fpie instead of -fpic. This will generate relative
addresses in the code section, but it will not use GOT and PLT for internal references.
Therefore, it will run faster than when compiled with -fpic and it will not have the
disadvantages mentioned above for the 32-bit case. The -fpie option is less useful in 32-
bit mode, where it still uses a GOT.（在64位系统下使用-fpic会存在问题。使用-fpie可以只针对代码区域
使用自身定位地址，但是不会使用GOT/PLT来解决内部引用问题）

You can't have public variables in a 64-bit shared object made with option -fpie because
the linker makes an error message when it sees a relative reference to a public variable
where it expects a GOT entry. You can avoid this error by avoiding any public variables. All
global variables (i.e. variables defined outside any function) should be hidden by using the
declaration "static" or "__attribute__((visibility ("hidden")))". A more
complicated solution is to use inline assembly code to give the variable two names, one
global and one local, and use the local name for local references.（因为-fpie不会使用GOT，所以便
没有办法解决全局变量问题，所有变量必须只对内可见）

*** System programming
** Metaprogramming
** Testing speed
The measured time is interpreted in the following way. The first count is always higher than
the subsequent counts. This is the time it takes to execute CriticalFunction when code
and data are not cached. The subsequent counts give the execution time when code and
data are cached as good as possible. The first count and the subsequent counts represent
the "worst case" and "best case" values. Which of these two values is closest to the truth
depends on whether CriticalFunction is called once or multiple times in the final
program and whether there is other code that uses the cache in between the calls to
CriticalFunction. If your optimization effort is concentrated on CPU efficiency then it is
the "best case" counts that you should look at to see if a certain modification is profitable.
On the other hand, if your optimization effort is concentrated on arranging data in order to
improve cache efficiency, then you may also look at the "worst case" counts.（如果关注CPU效率那么就看
best case也就是非初次情况下时钟耗费，而如果关注cache效率那么就看worst case也就是初次启动情况下时钟耗费）

Occasionally, the clock counts that you measure are much higher than normal. This
happens when a task switch occurs during execution of CriticalFunction. You cannot
avoid this in a protected operating system, but you can reduce the problem by increasing
the thread priority before the test and setting the priority back to normal afterwards.
（通过给予线程最高优先级别来减少任务切换带来的影响）

The time stamp counter is a little inaccurate on microprocessors that can change the clock
frequency (Intel SpeedStep® technology). A more accurate measurement can be obtained
with a performance monitor counter for "core clock cycles", using the test program
mentioned above.（如果CPU频率会自动调节的话，那么读取clock counter这种方式来计时就会存在问题）

