html/optimizing-software-in-cpp.html

<div id="outline-container-org75a0852" class="outline-3">
<h3 id="org75a0852"><span class="section-number-3">16.1</span> The pitfalls of unit-testing</h3>
</div>
<div id="outline-container-orgf730afc" class="outline-3">
<h3 id="orgf730afc"><span class="section-number-3">16.2</span> Worst-case testing</h3>
<div class="outline-text-3" id="text-16-2">
<p>
Each of the following methods could possibly be relevant when testing worst-case
performance:
</p>
<ul class="org-ul">
<li>The first time you activate a particular part of the program, it is likely to be slower than the subsequent times because of lazy loading of the code, cache misses and branch mispredictions.</li>
<li>Test the whole software package, including all runtime libraries and frameworks, rather than isolating a single function. Switch between different parts of the software package in order to increase the likelihood that certain parts of the program code are uncached or even swapped to disk.</li>
<li>Software that relies on network resources and servers should be tested on a network with heavy traffic and a server in full use rather than a dedicated test server.</li>
<li>Use large data files and databases with lots of data.</li>
<li>Use an old computer with a slow CPU, an insufficient amount of RAM, a lot of irrelevant software installed, a lot of background processes running, and a fragmented hard disk.</li>
<li>Test with different brands of CPUs, different types of graphics cards, etc.</li>
<li>Use an antivirus program that scans all files on access.（减少操作系统对文件缓存影响）</li>
<li>Run multiple processes or threads simultaneously. If the microprocessor has hyperthreading, then try to run two threads in each processor core.</li>
<li>Try to allocate more RAM than there is, in order to force the swapping of memory to disk.</li>
<li>Provoke cache misses by making the code size or data used in the innermost loop bigger than the cache size. Alternatively, you may actively invalidate the cache. The operating system may have a function for this purpose, or you may use the _mm_clflush intrinsic function. （通过指令强制cache失效）</li>
<li>Provoke branch mispredictions by making the data more random than normal.（使用随机数据来触发分支误判）</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgacacaa7" class="outline-2">
<h2 id="orgacacaa7"><span class="section-number-2">17</span> Optimization in embedded systems</h2>
</div>
<div id="outline-container-org14a3b88" class="outline-2">
<h2 id="org14a3b88"><span class="section-number-2">18</span> Overview of compiler options</h2>
</div>
</div>
</body>
</html>
